package main

import "fmt"

type Square [9][9]int

func main() {
	// Медленно решает
	square := Square{
		{0, 0, 0, 0, 6, 0, 7, 0, 0},
		{0, 5, 9, 0, 0, 0, 0, 0, 0},
		{0, 1, 0, 2, 0, 0, 0, 0, 0},
		{0, 0, 0, 1, 0, 0, 0, 0, 0},
		{6, 0, 0, 5, 0, 0, 0, 0, 0},
		{3, 0, 0, 0, 0, 0, 4, 6, 0},
		{0, 0, 0, 0, 0, 0, 0, 0, 0},
		{0, 0, 0, 0, 0, 0, 0, 9, 1},
		{8, 0, 0, 7, 4, 0, 0, 0, 0},
	}

	// Быстро решает
	// square := Square{
	// 	{0, 3, 8, 9, 6, 5, 7, 1, 4},
	// 	{7, 5, 9, 4, 1, 3, 6, 8, 2},
	// 	{4, 1, 6, 2, 7, 8, 9, 5, 3},

	// 	{9, 4, 5, 1, 3, 6, 2, 7, 8},
	// 	{6, 8, 7, 5, 2, 4, 1, 3, 9},
	// 	{3, 2, 1, 8, 9, 7, 4, 6, 5},

	// 	{0, 0, 0, 3, 5, 9, 8, 4, 7},
	// 	{5, 7, 4, 6, 8, 2, 3, 9, 1},
	// 	{8, 9, 3, 7, 4, 1, 0, 0, 0},
	// }

	if solve(&square) {
		printSquare(square)
	} else {
		println("No solution")
	}
}

func printSquare(s Square) {
	for _, row := range s {
		fmt.Println(row)
	}
	fmt.Println()
}
